content/roam/20211230142348-veos_presenation.org
:PROPERTIES:
:ID:       70b95c80-879e-4328-9c67-d4b0074914a1
:END:
#+title: veos-presenation

* 标题，主题
** reward is enough
** 基于大数据和奖励驱动的能源优化系统
* 背景
** 车辆能源优化系统
*** 基于专家系统
**** 基于规则
**** 传统机器学习，需要划分场景
**** 大数据应用效率低
*** 通常应用场景是混动车动力系统最优分配比
** 强化学习
*** 端到端，场景的切换是连续动态的
*** 适用于带噪声的高维度非平稳随机过程
*** 随机闭环控制：可利用随机采样的结果及时更新策略
*** 挑战
**** 需要大量数据和规模化应用
**** 不容易泛化
**** 样本使用效率低 OpenAI Five for Dota， 45000年
** 真实物理世界的强化学习应用（除游戏和仿真领域）
*** 谷歌计算中心空调系统
*** 神经网络架构搜索NAS
*** 集成电路芯片设计
*** OpenAI Rubik's Cube
* 方案
** 一型决策系统
*** 几秒内的短期决策，不考虑长期策略
*** 避免高复杂度的长效策略优化
*** 避免复杂的功劳归属问题（Credit Assignment)
** 场景段（方式）
*** 无限时间地平线也可以，但是需要大量的时间和长期测试才可能收集到能耗和场景的分布
*** 分成场景段（episodic）方式有利于验证方案，也可以扩展
** 优点
*** 非监督学习，不需要标注，唯一的监督信号是能耗
*** 从大数据中学习
*** 动态适应工况，持续更新模型
*** 驾驶员是环境的一部分，不需要为驾驶员行为建模
*** 可定义安全边界，不影响司机的安全驾驶
* 数据要求
** 观测量需求
*** 不需要导航数据，运动规划数据
*** 可观测性
** 决策空间
*** 可控性:能有效影响能耗
*** 电动力系统控制器参数
* 机器学习框架
** 基于策略梯度方式
** 离线策略（Off Policy）:可提高样本利用效率
** 记忆池收集经验
* 项目测试情况
** 封闭园区测试
** 开放道路测试
** 开放道路自由路况测试
*** 预训练，冻结模型
** 分析
*** 利用能量回收
* 展望和风险
** 量产
** 算法：
*** 利用RNN进行时间序列编码
*** 离线记忆数据的有效检索和利用
