20211230142348-veos_presenation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>veos-presenation</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">veos-presenation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0146b26">标题，主题</a>
<ul>
<li><a href="#org9de5ab0">reward is enough</a></li>
<li><a href="#org54c1b6a">基于大数据和奖励驱动的能源优化系统</a></li>
</ul>
</li>
<li><a href="#org7df3256">背景</a>
<ul>
<li><a href="#org6202f8f">车辆能源优化系统</a>
<ul>
<li><a href="#orgdda6b89">基于专家系统</a></li>
<li><a href="#org6a3ebf1">通常应用场景是混动车动力系统最优分配比</a></li>
</ul>
</li>
<li><a href="#orgb9deebd">强化学习</a>
<ul>
<li><a href="#org8325ca1">端到端，场景的切换是连续动态的</a></li>
<li><a href="#orgd6dc821">适用于带噪声的高维度非平稳随机过程</a></li>
<li><a href="#org1ccafd4">随机闭环控制：可利用随机采样的结果及时更新策略</a></li>
<li><a href="#org46110c6">挑战</a></li>
</ul>
</li>
<li><a href="#orgc744041">真实物理世界的强化学习应用（除游戏和仿真领域）</a>
<ul>
<li><a href="#org574e168">谷歌计算中心空调系统</a></li>
<li><a href="#org377f39d">神经网络架构搜索NAS</a></li>
<li><a href="#orgbd3234e">集成电路芯片设计</a></li>
<li><a href="#org463eba1">OpenAI Rubik's Cube</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org021f756">方案</a>
<ul>
<li><a href="#orgd7aa734">一型决策系统</a>
<ul>
<li><a href="#org93cf608">几秒内的短期决策，不考虑长期策略</a></li>
<li><a href="#org2d1ec4e">避免高复杂度的长效策略优化</a></li>
<li><a href="#org26c0d46">避免复杂的功劳归属问题（Credit Assignment)</a></li>
</ul>
</li>
<li><a href="#orgb867973">场景段（方式）</a>
<ul>
<li><a href="#org4bf0551">无限时间地平线也可以，但是需要大量的时间和长期测试才可能收集到能耗和场景的分布</a></li>
<li><a href="#org0e30ad9">分成场景段（episodic）方式有利于验证方案，也可以扩展</a></li>
</ul>
</li>
<li><a href="#orgf634e9a">优点</a>
<ul>
<li><a href="#org4435c35">非监督学习，不需要标注，唯一的监督信号是能耗</a></li>
<li><a href="#org4d39545">从大数据中学习</a></li>
<li><a href="#org008f676">动态适应工况，持续更新模型</a></li>
<li><a href="#org5a6ce0b">驾驶员是环境的一部分，不需要为驾驶员行为建模</a></li>
<li><a href="#orgc4bf98b">可定义安全边界，不影响司机的安全驾驶</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga665650">数据要求</a>
<ul>
<li><a href="#org72a9b71">观测量需求</a>
<ul>
<li><a href="#org9549544">不需要导航数据，运动规划数据</a></li>
<li><a href="#orgbe3fbab">可观测性</a></li>
</ul>
</li>
<li><a href="#org5235762">决策空间</a>
<ul>
<li><a href="#org29da5fc">可控性:能有效影响能耗</a></li>
<li><a href="#orgbd90809">电动力系统控制器参数</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd2e1da4">机器学习框架</a>
<ul>
<li><a href="#orgc03d06c">基于策略梯度方式</a></li>
<li><a href="#orgbea9303">离线策略（Off Policy）:可提高样本利用效率</a></li>
<li><a href="#org9453359">记忆池收集经验</a></li>
</ul>
</li>
<li><a href="#orgf90934d">项目测试情况</a>
<ul>
<li><a href="#orgf5635f4">封闭园区测试</a></li>
<li><a href="#orgc830585">开放道路测试</a></li>
<li><a href="#org31c9936">开放道路自由路况测试</a>
<ul>
<li><a href="#orge80e9b3">预训练，冻结模型</a></li>
</ul>
</li>
<li><a href="#org42c968e">分析</a>
<ul>
<li><a href="#org3d1483b">利用能量回收</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge9c7691">展望和风险</a>
<ul>
<li><a href="#orge4b4d56">量产</a></li>
<li><a href="#orgf47d2b8">算法：</a>
<ul>
<li><a href="#orgc06ed2a">利用RNN进行时间序列编码</a></li>
<li><a href="#org7d1b631">离线记忆数据的有效检索和利用</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       70b95c80-879e-4328-9c67-d4b0074914a1
</p>

<div id="outline-container-org0146b26" class="outline-2">
<h2 id="org0146b26">标题，主题</h2>
<div class="outline-text-2" id="text-org0146b26">
</div>
<div id="outline-container-org9de5ab0" class="outline-3">
<h3 id="org9de5ab0">reward is enough</h3>
</div>
<div id="outline-container-org54c1b6a" class="outline-3">
<h3 id="org54c1b6a">基于大数据和奖励驱动的能源优化系统</h3>
</div>
</div>
<div id="outline-container-org7df3256" class="outline-2">
<h2 id="org7df3256">背景</h2>
<div class="outline-text-2" id="text-org7df3256">
</div>
<div id="outline-container-org6202f8f" class="outline-3">
<h3 id="org6202f8f">车辆能源优化系统</h3>
<div class="outline-text-3" id="text-org6202f8f">
</div>
<div id="outline-container-orgdda6b89" class="outline-4">
<h4 id="orgdda6b89">基于专家系统</h4>
<div class="outline-text-4" id="text-orgdda6b89">
</div>
<ul class="org-ul">
<li><a id="org6727b93"></a>基于规则<br /></li>
<li><a id="org419ae9b"></a>传统机器学习，需要划分场景<br /></li>
<li><a id="org9a49242"></a>大数据应用效率低<br /></li>
</ul>
</div>
<div id="outline-container-org6a3ebf1" class="outline-4">
<h4 id="org6a3ebf1">通常应用场景是混动车动力系统最优分配比</h4>
</div>
</div>
<div id="outline-container-orgb9deebd" class="outline-3">
<h3 id="orgb9deebd">强化学习</h3>
<div class="outline-text-3" id="text-orgb9deebd">
</div>
<div id="outline-container-org8325ca1" class="outline-4">
<h4 id="org8325ca1">端到端，场景的切换是连续动态的</h4>
</div>
<div id="outline-container-orgd6dc821" class="outline-4">
<h4 id="orgd6dc821">适用于带噪声的高维度非平稳随机过程</h4>
</div>
<div id="outline-container-org1ccafd4" class="outline-4">
<h4 id="org1ccafd4">随机闭环控制：可利用随机采样的结果及时更新策略</h4>
</div>
<div id="outline-container-org46110c6" class="outline-4">
<h4 id="org46110c6">挑战</h4>
<div class="outline-text-4" id="text-org46110c6">
</div>
<ul class="org-ul">
<li><a id="orgbb40dcf"></a>需要大量数据和规模化应用<br /></li>
<li><a id="org10fd2c1"></a>不容易泛化<br /></li>
<li><a id="org7d7d7b2"></a>样本使用效率低 OpenAI Five for Dota， 45000年<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgc744041" class="outline-3">
<h3 id="orgc744041">真实物理世界的强化学习应用（除游戏和仿真领域）</h3>
<div class="outline-text-3" id="text-orgc744041">
</div>
<div id="outline-container-org574e168" class="outline-4">
<h4 id="org574e168">谷歌计算中心空调系统</h4>
</div>
<div id="outline-container-org377f39d" class="outline-4">
<h4 id="org377f39d">神经网络架构搜索NAS</h4>
</div>
<div id="outline-container-orgbd3234e" class="outline-4">
<h4 id="orgbd3234e">集成电路芯片设计</h4>
</div>
<div id="outline-container-org463eba1" class="outline-4">
<h4 id="org463eba1">OpenAI Rubik's Cube</h4>
</div>
</div>
</div>
<div id="outline-container-org021f756" class="outline-2">
<h2 id="org021f756">方案</h2>
<div class="outline-text-2" id="text-org021f756">
</div>
<div id="outline-container-orgd7aa734" class="outline-3">
<h3 id="orgd7aa734">一型决策系统</h3>
<div class="outline-text-3" id="text-orgd7aa734">
</div>
<div id="outline-container-org93cf608" class="outline-4">
<h4 id="org93cf608">几秒内的短期决策，不考虑长期策略</h4>
</div>
<div id="outline-container-org2d1ec4e" class="outline-4">
<h4 id="org2d1ec4e">避免高复杂度的长效策略优化</h4>
</div>
<div id="outline-container-org26c0d46" class="outline-4">
<h4 id="org26c0d46">避免复杂的功劳归属问题（Credit Assignment)</h4>
</div>
</div>
<div id="outline-container-orgb867973" class="outline-3">
<h3 id="orgb867973">场景段（方式）</h3>
<div class="outline-text-3" id="text-orgb867973">
</div>
<div id="outline-container-org4bf0551" class="outline-4">
<h4 id="org4bf0551">无限时间地平线也可以，但是需要大量的时间和长期测试才可能收集到能耗和场景的分布</h4>
</div>
<div id="outline-container-org0e30ad9" class="outline-4">
<h4 id="org0e30ad9">分成场景段（episodic）方式有利于验证方案，也可以扩展</h4>
</div>
</div>
<div id="outline-container-orgf634e9a" class="outline-3">
<h3 id="orgf634e9a">优点</h3>
<div class="outline-text-3" id="text-orgf634e9a">
</div>
<div id="outline-container-org4435c35" class="outline-4">
<h4 id="org4435c35">非监督学习，不需要标注，唯一的监督信号是能耗</h4>
</div>
<div id="outline-container-org4d39545" class="outline-4">
<h4 id="org4d39545">从大数据中学习</h4>
</div>
<div id="outline-container-org008f676" class="outline-4">
<h4 id="org008f676">动态适应工况，持续更新模型</h4>
</div>
<div id="outline-container-org5a6ce0b" class="outline-4">
<h4 id="org5a6ce0b">驾驶员是环境的一部分，不需要为驾驶员行为建模</h4>
</div>
<div id="outline-container-orgc4bf98b" class="outline-4">
<h4 id="orgc4bf98b">可定义安全边界，不影响司机的安全驾驶</h4>
</div>
</div>
</div>
<div id="outline-container-orga665650" class="outline-2">
<h2 id="orga665650">数据要求</h2>
<div class="outline-text-2" id="text-orga665650">
</div>
<div id="outline-container-org72a9b71" class="outline-3">
<h3 id="org72a9b71">观测量需求</h3>
<div class="outline-text-3" id="text-org72a9b71">
</div>
<div id="outline-container-org9549544" class="outline-4">
<h4 id="org9549544">不需要导航数据，运动规划数据</h4>
</div>
<div id="outline-container-orgbe3fbab" class="outline-4">
<h4 id="orgbe3fbab">可观测性</h4>
</div>
</div>
<div id="outline-container-org5235762" class="outline-3">
<h3 id="org5235762">决策空间</h3>
<div class="outline-text-3" id="text-org5235762">
</div>
<div id="outline-container-org29da5fc" class="outline-4">
<h4 id="org29da5fc">可控性:能有效影响能耗</h4>
</div>
<div id="outline-container-orgbd90809" class="outline-4">
<h4 id="orgbd90809">电动力系统控制器参数</h4>
</div>
</div>
</div>
<div id="outline-container-orgd2e1da4" class="outline-2">
<h2 id="orgd2e1da4">机器学习框架</h2>
<div class="outline-text-2" id="text-orgd2e1da4">
</div>
<div id="outline-container-orgc03d06c" class="outline-3">
<h3 id="orgc03d06c">基于策略梯度方式</h3>
</div>
<div id="outline-container-orgbea9303" class="outline-3">
<h3 id="orgbea9303">离线策略（Off Policy）:可提高样本利用效率</h3>
</div>
<div id="outline-container-org9453359" class="outline-3">
<h3 id="org9453359">记忆池收集经验</h3>
</div>
</div>
<div id="outline-container-orgf90934d" class="outline-2">
<h2 id="orgf90934d">项目测试情况</h2>
<div class="outline-text-2" id="text-orgf90934d">
</div>
<div id="outline-container-orgf5635f4" class="outline-3">
<h3 id="orgf5635f4">封闭园区测试</h3>
</div>
<div id="outline-container-orgc830585" class="outline-3">
<h3 id="orgc830585">开放道路测试</h3>
</div>
<div id="outline-container-org31c9936" class="outline-3">
<h3 id="org31c9936">开放道路自由路况测试</h3>
<div class="outline-text-3" id="text-org31c9936">
</div>
<div id="outline-container-orge80e9b3" class="outline-4">
<h4 id="orge80e9b3">预训练，冻结模型</h4>
</div>
</div>
<div id="outline-container-org42c968e" class="outline-3">
<h3 id="org42c968e">分析</h3>
<div class="outline-text-3" id="text-org42c968e">
</div>
<div id="outline-container-org3d1483b" class="outline-4">
<h4 id="org3d1483b">利用能量回收</h4>
</div>
</div>
</div>
<div id="outline-container-orge9c7691" class="outline-2">
<h2 id="orge9c7691">展望和风险</h2>
<div class="outline-text-2" id="text-orge9c7691">
</div>
<div id="outline-container-orge4b4d56" class="outline-3">
<h3 id="orge4b4d56">量产</h3>
</div>
<div id="outline-container-orgf47d2b8" class="outline-3">
<h3 id="orgf47d2b8">算法：</h3>
<div class="outline-text-3" id="text-orgf47d2b8">
</div>
<div id="outline-container-orgc06ed2a" class="outline-4">
<h4 id="orgc06ed2a">利用RNN进行时间序列编码</h4>
</div>
<div id="outline-container-org7d1b631" class="outline-4">
<h4 id="org7d1b631">离线记忆数据的有效检索和利用</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
